/* ************************************************************************** */
/*                                                                            */
/*                                                        :::      ::::::::   */
/*   utils2.c                                           :+:      :+:    :+:   */
/*                                                    +:+ +:+         +:+     */
/*   By: ilko <ilko@student.42seoul.kr>             +#+  +:+       +#+        */
/*                                                +#+#+#+#+#+   +#+           */
/*   Created: 2024/01/26 04:35:29 by ilko              #+#    #+#             */
/*   Updated: 2024/01/26 04:35:33 by ilko             ###   ########.fr       */
/*                                                                            */
/* ************************************************************************** */

#include "../../include/cub3d.h"

double	ft_abs(double i)
{
	return ((i * (i >= 0) + -i * (i < 0)));
}

/**
 * degree 스케일의 각도값을 radian 으로 변경하는 함수.
*/
double	deg_to_rad(double deg)
{
	return (deg * 2 * M_PI / 360);
}
